#+TITLE: Issue 22
** /workspace
#+begin_src shell :prologue "kubectl exec -ti infra-db-0 -c postgres -- bash -c '\n" :epilogue "\ncd /workspace'"
ls -lah /workspace
#+end_src

#+RESULTS:
#+begin_example
total 138M
drwxrwxrwx  3 root  root  4.0K Mar 31 03:50 .
drwxr-xr-x  1 root  root  4.0K Mar 31 03:52 ..
-rw-r--r--  1 root  root  1.8M Mar 31 03:50 bq_latest_successful_jobs.json
-rwxr-xr-x  1 65532 65532 2.7M Mar 31 03:50 infrasnoop-jobs.json
-rw-r--r--  1 root  root  1.6M Mar 31 03:50 latest_successful_jobs.json
-rw-r--r--  1 root  root  112M Mar 31 03:52 massaged.csv
-rw-r--r--  1 root  root   12M Mar 31 03:50 testgrid-config.json
-rw-r--r--  1 root  root  8.3M Mar 31 03:50 testgrid-config.yaml
drwxr-xr-x 36 root  root  4.0K Mar 31 03:50 test-infra
#+end_example
** latest_successful_jobs.json
#+begin_src shell :prologue "kubectl exec -ti infra-db-0 -- bash -c '\n" :epilogue "\ncd /workspace'"
cat /workspace/bq_latest_successful_jobs.json  | jq .[0]
#+end_src

#+RESULTS:
#+begin_example
{
  "job": "aks-engine-azure-file-master",
  "number": "1389315306542862336",
  "path": "gs://kubernetes-jenkins/logs/aks-engine-azure-file-master/1389315306542862336",
  "started": "2021-05-03 20:27:50"
}
#+end_example
